spec/fixtures/stripe_webhooks/customer.subscription.deleted.json

{
  "id": "evt_00000000000000",
  "object": "event",
  "api_version": "2017-04-06",
  "created": 1496232624,
  "data": {
    "object": {
      "id": "sub_00000000000000",
      "object": "subscription",
      "application_fee_percent": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "created": 1496232623,
      "current_period_end": 1498824623,
      "current_period_start": 1496232623,
      "customer": "cus_Al1iHJsgh2iMj2",
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_00000000",
            "object": "subscription_item",
            "created": 1496232624,
            "plan": {
              "id": "s-basic",
              "object": "plan",
              "amount": 599,
              "created": 1494334156,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "name": "S Basic",
              "statement_descriptor": null,
              "trial_period_days": null
            },
            "quantity": 1
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": ""
      },
      "livemode": false,
      "metadata": {
      },
      "plan": {
        "id": "s-basic",
        "object": "plan",
        "amount": 599,
        "created": 1494334156,
        "currency": "usd",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {
        },
        "name": "S Basic",
        "statement_descriptor": null,
        "trial_period_days": null
      },
      "quantity": 1,
      "start": 1496232623,
      "status": "active",
      "tax_percent": null,
      "trial_end": null,
      "trial_start": null
    }
  },
  "livemode": false,
  "pending_webhooks": 0,
  "request": "req_Al1inviVvNH7vG",
  "type": "customer.subscription.deleted"
}