spec/fixtures/stripe_webhooks/invoice.payment_succeeded.json

{
  "created": 1326853478,
  "livemode": false,
  "id": "evt_00000000000000",
  "type": "invoice.payment_succeeded",
  "object": "event",
  "request": null,
  "pending_webhooks": 1,
  "api_version": "2015-02-18",
  "data": {
    "object": {
      "date": 1438123464,
      "id": "in_00000000000000",
      "period_start": 1435529897,
      "period_end": 1438121897,
      "lines": {
        "data": [
          {
            "id": "sub_6hEYZ2ZCmMElwp",
            "object": "line_item",
            "type": "subscription",
            "livemode": true,
            "amount": 0,
            "currency": "eur",
            "proration": false,
            "period": {
              "start": 1438159121,
              "end": 1438763921
            },
            "subscription": null,
            "quantity": 1,
            "plan": {
              "interval": "month",
              "name": "LearnSignal Personal",
              "created": 1427284587,
              "amount": 999,
              "currency": "eur",
              "id": "development-41O2JywQSud5BJguzDfw",
              "object": "plan",
              "livemode": false,
              "interval_count": 1,
              "trial_period_days": 7,
              "metadata": {},
              "statement_descriptor": "LearnSignal"
            },
            "description": null,
            "discountable": true,
            "metadata": {}
          }
        ],
        "total_count": 1,
        "object": "list",
        "url": "/v1/invoices/in_6h4yzhIAEDukrA/lines"
      },
      "subtotal": 1000,
      "total": 1000,
      "customer": "cus_00000000000000",
      "object": "invoice",
      "attempted": true,
      "closed": true,
      "forgiven": false,
      "paid": true,
      "livemode": false,
      "attempt_count": 0,
      "amount_due": 1000,
      "currency": "eur",
      "starting_balance": 0,
      "ending_balance": null,
      "next_payment_attempt": 1438127064,
      "webhooks_delivered_at": null,
      "charge": "_00000000000000",
      "discount": null,
      "application_fee": null,
      "subscription": "sub_00000000000000",
      "tax_percent": null,
      "tax": null,
      "metadata": {},
      "statement_descriptor": null,
      "description": null,
      "receipt_number": null
    }
  }
}
